In [ ]:
pip install ftfy

In [ ]:
pip install Kaggle

In [ ]:
pip install kagglehub

In [6]:
import pandas as pd
import numpy as np
#from kaggle.api.kaggle_api_extended import KaggleApi
from datetime import date
import os
import hashlib

In [599]:
#os.environ['KAGGLE_CONFIG_DIR'] = os.path.abspath(".")
os.environ['KAGGLE_USERNAME'] = 'davidillner' # Nahraď svým uživatelským jménem
os.environ['KAGGLE_KEY'] = '9c2c97f56923d4e4a301facbab255e5e' # Nahraď svým API klíčem

In [600]:
api = KaggleApi()
api.authenticate()

# Pak můžeš použít API – třeba stáhnout dataset
api.dataset_download_files("arashnic/book-recommendation-dataset", path="data/", unzip=True)

Dataset URL: https://www.kaggle.com/datasets/arashnic/book-recommendation-dataset

In [425]:
books_df = pd.read_csv("data/Books.csv", sep=",", encoding="utf-8")

C:\Users\tomas\AppData\Local\Temp\ipykernel_25596\2124625489.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books_df = pd.read_csv("data/Books.csv", sep=",", encoding="utf-8")

In [464]:
# Aplikuj funkci na sloupce s textovými daty
columns_to_change = ['Book-Title', 'Book-Author', 'Publisher']
for col in columns_to_change:
    books_df[col] = books_df[col].apply(fix_special_characters)

In [428]:
df = books_df[books_df["ISBN"].isin(["3423202343"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
3119,3423202343,Was Männer sagen.,Joan Smith,1999,Dtv,http://images.amazon.com/images/P/3423202343.0...,http://images.amazon.com/images/P/3423202343.0...,http://images.amazon.com/images/P/3423202343.0...

In [429]:
import chardet

with open("data/Books.csv", 'rb') as f:
    result = chardet.detect(f.read())
    print(result)

{'encoding': 'utf-8', 'confidence': 0.99, 'language': ''}

In [430]:
df = books_df[books_df["ISBN"].isin(["2264034602"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
167446,2264034602,La Terre sous ses pieds,Salman Rushdie,2002,Éditions 10/18,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...

In [431]:
import ftfy
books_df['Publisher'] = books_df['Publisher'].astype(str).apply(ftfy.fix_text)

In [ ]:
# Mapa pro opravy specifických znaků
repair_map = {
    # Běžné Latin-1/CP1252 znaky čtené jako UTF-8
    'Ã©': 'é',
    'Ã¨': 'è',
    'Ã­': 'í',
    'Ã§': 'ç',
    'Ã³': 'ó',
    'Ã¡': 'á',
    'Ã´': 'ô',
    'Ã¼': 'ü',
    'Ã¶': 'ö',
    'Ã½': 'ý',
    'Ã£': 'ã',
    'Ãº': 'ú',

    # Běžné Latin-1/CP1252 uppercase a ß čtené jako UTF-8 (často se zobrazí jako Ã? + znak)
    'Ã?Â¤': 'ä', # MÃ?Â¤nner -> Männer
    'Ã?Â©': 'é', # VÃ?Â©ritÃ?Â© -> Vérité
    'Ã?Â¼': 'ü', # fÃ?Â¼r -> für, Ã?Â¼brig -> übrig, HÃ¼geln -> Hügeln, WÃ¼ste -> Wüste, fÃ¼nfzehn -> fünfzehn
    'Ã?Â¶': 'ö', # VolksvermÃ?Â¶gen -> Volksvermögen, SÃ¶hne -> Söhne, kÃ¶nnen -> können, schÃ¶nen -> schönen, schÃ¶nsten -> schönsten
    'Ã?Â?': 'Ü', # Ã?Â?ber -> Über, Ã?Â?bermorgen -> Übermorgen, Ã?Â?berallnie -> Überallnie, Ã?Â?berfall -> Überfall, Ã?Â?berleben -> Überleben, Ã?Â?berraschung -> Überraschung, Ã?Â?berall -> Überall, Ã?Â?bernachten -> Übernachten
    'Ã?Â?': 'Ä', # Ã?Â?rger -> Ärger, VÃ¤ter -> Väter, Ã?Â¤hlt -> ählt (v erzÃ?Â¤hlt)
    'Ã?Â?': 'Ö', # Ã?Â?stlich -> Östlich, Ã?rsringen -> Örsringen, Ã?Â?lpiraten -> Ölpiraten, Ã?kotopia -> Ökotopia, Ã?sterlich -> Österlich
    'Ã?Â?': 'É', # Ã?Â?ditions -> Éditions, Ã?thique -> Éthique, Ã?tude -> Étude, Ã?aque -> Éaque
    'Ã?Â?': 'Á', # Ã?Â?. Kolumnen -> Á. Kolumnen, Ã?ngeles -> Ángeles, Ã?Â?a -> Áa
    'Ã?Â?': 'Í', # Ã?Â?yunim -> Íyunim
    'Ã?ÂŸ': 'ß', # ProzeÃ?ÂŸ -> Prozeß, sÃ¼ÃŸ -> süß, WachgekÃ?Â¼Ã?Â?t -> Wachgeküßt

    # Další běžné mojibake vzory
    'Â¿': '¿', # Â¿QuiÃ©n -> ¿Quién, Â¿QuÃ© -> ¿Qué, Â¿Eres -> ¿Eres
    'Â¡': '¡', # Â¡Corre -> ¡Corre, Â¡Trato -> ¡Trato, Â¡DÃ­melo -> ¡Dímelo, Â¡No -> ¡No, Â¡Cristina -> ¡Cristina

    # České znaky
    'ÄŤ': 'č',
    'Å™': 'ř',
    'Å¡': 'š',
    'Å¾': 'ž',
    'Ãº': 'ú', 

    # Příklad opravy pro 'Ã? sucesso solo 50 anni fa' - vypadá to, že 'Ã? ' by mělo být 'Il '
    'Ã? ': 'Il ',
}


def fix_special_characters(text):
    if isinstance(text, str):  # Zkontroluj, že text je řetězec
        for wrong, correct in repair_map.items():
            text = text.replace(wrong, correct)
    return text

# Aplikuj funkci na sloupce s textovými daty
books_df['Publisher'] = books_df['Publisher'].apply(fix_special_characters)

In [432]:
df = books_df[books_df["ISBN"].isin(["2264034602"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
167446,2264034602,La Terre sous ses pieds,Salman Rushdie,2002,Éditions 10/18,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...

In [14]:
books_df = pd.read_csv("db_init/data/Books.csv")
ratings_df = pd.read_csv("db_init/data/Ratings.csv")
users_df = pd.read_csv("db_init/data/Users.csv")

C:\Users\tomas\AppData\Local\Temp\ipykernel_23576\258498689.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books_df = pd.read_csv("db_init/data/Books.csv")

In [15]:
# Doplnění unikátního hashe pro databázi, detekce duplicit
hash_id = ratings_df["User-ID"].astype(str) + "_" + ratings_df["ISBN"].astype(str) 
ratings_df["Ratings-ID"] = hash_id.map(lambda x: hashlib.md5(x.encode()).hexdigest())
ratings_df["Ratings-ID"].drop_duplicates()

# Přesun sloupce s hash(Rating-ID) na začátek
ratings_df = ratings_df.iloc[:,[3, 0, 1, 2]]

# Odstranění ratings pro které nejsou knihy v books (Pokud se později ty knihy nepřidají)
valid_isbn = set(books_df["ISBN"].dropna()) 
ratings_df = ratings_df[ratings_df["ISBN"].isin(valid_isbn)]

ratings_df.head()

                         Ratings-ID  User-ID        ISBN  Book-Rating
0  6eca102726a99b63019015cccd4d3f32   276725  034545104X            0
1  ec743c2d0115f99a2df5edf2d26ca583   276726  0155061224            5
2  17fb768806db41b382fdf73208537c32   276727  0446520802            0
3  e2b175aceb888e02cd2698b967883563   276729  052165615X            3
4  37d77b80880d970e38a4465dfbe64e33   276729  0521795028            6

In [434]:
books_df.dtypes

ISBN                   object
Book-Title             object
Book-Author            object
Year-Of-Publication    object
Publisher              object
Image-URL-S            object
Image-URL-M            object
Image-URL-L            object
dtype: object

In [435]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271360 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [436]:
books_df.describe()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
count,271360,271360,271358,271360,271360,271360,271360,271357
unique,271360,242134,101970,202,16796,271044,271044,271041
top,0195153448,Selected Poems,Agatha Christie,2002,Harlequin,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/225307649X.0...
freq,1,27,632,13903,7535,2,2,2

In [437]:
print(books_df.isnull().sum())

ISBN                   0
Book-Title             0
Book-Author            2
Year-Of-Publication    0
Publisher              0
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64

In [438]:
empty_author_df = books_df[books_df["Book-Author"].isnull()]
empty_author_df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
118033,0751352497,A+ Quiz Masters:01 Earth,NaN,1999,Dorling Kindersley,http://images.amazon.com/images/P/0751352497.0...,http://images.amazon.com/images/P/0751352497.0...,http://images.amazon.com/images/P/0751352497.0...
187689,9627982032,The Credit Suisse Guide to Managing Your Perso...,NaN,1995,Edinburgh Financial Publishing,http://images.amazon.com/images/P/9627982032.0...,http://images.amazon.com/images/P/9627982032.0...,http://images.amazon.com/images/P/9627982032.0...

In [439]:
empty_publisher_df = books_df[books_df["Publisher"].isnull()]
empty_publisher_df.head()

Empty DataFrame
Columns: [ISBN, Book-Title, Book-Author, Year-Of-Publication, Publisher, Image-URL-S, Image-URL-M, Image-URL-L]
Index: []

In [440]:
books_df["Year-Of-Publication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1900', '1942', '1923', '1920', '1933', 'Gallimard', '1909',
       '1946', '2008', '1378', '2030', '1936', '1947', '2011', '2020',
       '1919', '1949', '1922', '1897', '2024', '1376', '1926', '2037'],
      dtype=object)

In [441]:
df = books_df[books_df["ISBN"].isin(["0060168579", "078946697X", "2070426769", "0789466953"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
136768,0060168579,"\Yes\"" or \""No\"": The Guide to Better Decisions""",Spencer Johnson,1992,Harpercollins,http://images.amazon.com/images/P/0060168579.0...,http://images.amazon.com/images/P/0060168579.0...,http://images.amazon.com/images/P/0060168579.0...
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...,http://images.amazon.com/images/P/078946697X.0...,http://images.amazon.com/images/P/078946697X.0...,NaN
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-M...",2003,Gallimard,http://images.amazon.com/images/P/2070426769.0...,http://images.amazon.com/images/P/2070426769.0...,http://images.amazon.com/images/P/2070426769.0...,NaN
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...,http://images.amazon.com/images/P/0789466953.0...,http://images.amazon.com/images/P/0789466953.0...,NaN

In [ ]:
mask_wrong_title = books_df["Book-Title"].str.contains(r'\\";')
index_to_fix = books_df[mask_wrong_title].index
author_columns = books_df.columns[books_df.columns.get_loc('Book-Author'):].tolist()

for index in index_to_fix:
    problematic_title = books_df.loc[index, 'Book-Title']

    # Split the string by '\";'
    parts = problematic_title.split('\\";', 1)

    if len(parts) == 2:
        correct_title = parts[0]
        # The part after '\";' je začátek dat, která se posunula doleva
        # První prvek v 'data_to_shift_left' by měl být správný autor
        start_of_shifted_data = parts[1]

        # Získáme hodnoty ze sloupců, které jsou aktuálně posunuté, začínáme od 'Book-Author'
        # Tyto sloupce aktuálně obsahují data, která by měla být ve sloupcích vlevo
        # Např. 'Book-Author' obsahuje Year_val, 'Year-Of-Publication' obsahuje Pub_val atd.
        current_shifted_values = books_df.loc[index, author_columns].tolist()

        # Vytvoříme nový seznam hodnot pro sloupce_k_posunuti_doleva
        # První hodnota bude to, co následovalo po '\";' (což by měl být správný autor)
        # Správné hodnoty pro sloupce od 'Book-Author' dál
        # První hodnota je extrahovaný autor (start_of_shifted_data)
        # Následují hodnoty z 'current_shifted_values', posunuté o jednu pozici doleva
        correctly_ordered_values = [start_of_shifted_data] + current_shifted_values[:-1]


        # Přiřadíme opravený název knihy
        books_df.loc[index, 'Book-Title'] = correct_title

        # Přiřadíme opravené a posunuté hodnoty do sloupců od 'Book-Author' dál
        books_df.loc[index, author_columns] = correctly_ordered_values
        books_df['Book-Title'] = books_df['Book-Title'].str.strip('"')

In [443]:
books_df["Year-Of-Publication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', '1943', '1938', '1900', '1942', '1923',
       '1920', '1933', '1909', '1946', '2008', '1378', '2030', '1936',
       '1947', '2011', '2020', '1919', '1949', '1922', '1897', '2024',
       '1376', '1926', '2037'], dtype=object)

In [444]:
df = books_df[books_df["ISBN"].isin(["0060168579", "078946697X", "2070426769", "0789466953"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
136768,0060168579,"\Yes\"" or \""No\"": The Guide to Better Decisions",Spencer Johnson,1992,Harpercollins,http://images.amazon.com/images/P/0060168579.0...,http://images.amazon.com/images/P/0060168579.0...,http://images.amazon.com/images/P/0060168579.0...
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...","Michael Teitelbaum""",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...,http://images.amazon.com/images/P/078946697X.0...,http://images.amazon.com/images/P/078946697X.0...
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers",Jean-Marie Gustave Le Clézio,2003,Gallimard,http://images.amazon.com/images/P/2070426769.0...,http://images.amazon.com/images/P/2070426769.0...,http://images.amazon.com/images/P/2070426769.0...
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",James Buckley,2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...,http://images.amazon.com/images/P/0789466953.0...,http://images.amazon.com/images/P/0789466953.0...

In [ ]:
columns_to_change = ['Book-Title', 'Book-Author', 'Publisher']
for col in columns_to_change:
    books_df[col] = books_df[col].str.replace(r'\\"', '"', regex=True)
    books_df[col] = books_df[col].str.replace(r'\\', '"', regex=True)
    books_df[col] = books_df[col].str.replace('&amp;', ' & ', regex=False)
    books_df[col] = books_df[col].str.strip('"')

In [446]:
isinstance(books_df,pd.DataFrame)

True

In [447]:
books_df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [448]:
fddf = books_df[books_df["ISBN"] == "0416652700"]
fddf.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
98284,0416652700,"The Pooh cook book: inspired by ""Winnie-the-Po...",";Katie Stewart""",1971,Methuen,http://images.amazon.com/images/P/0416652700.0...,http://images.amazon.com/images/P/0416652700.0...,http://images.amazon.com/images/P/0416652700.0...

In [449]:
books_df["Year-Of-Publication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', '1943', '1938', '1900', '1942', '1923',
       '1920', '1933', '1909', '1946', '2008', '1378', '2030', '1936',
       '1947', '2011', '2020', '1919', '1949', '1922', '1897', '2024',
       '1376', '1926', '2037'], dtype=object)

In [450]:
books_df["Year-Of-Publication"] = pd.to_numeric(books_df["Year-Of-Publication"], errors="coerce")

In [451]:
books_df["Year-Of-Publication"].unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984,    0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, 2012, 2006, 1909, 2008, 1378,
       1919, 1922, 1897, 2024, 1376, 2037], dtype=int64)

In [452]:
early_years_df = books_df[books_df["Year-Of-Publication"] == 1376]
early_years_df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
253750,964442011X,Tasht-i khun,IsmaÂ°il Fasih,1376,Nashr-i Alburz,http://images.amazon.com/images/P/964442011X.0...,http://images.amazon.com/images/P/964442011X.0...,http://images.amazon.com/images/P/964442011X.0...

In [453]:
zero_years_df = books_df[books_df["Year-Of-Publication"] == 0]
print(zero_years_df.shape)

(4618, 8)

In [454]:
date_now = date.today()
print(date_now.year)

2025

In [455]:
future_books = books_df[books_df["Year-Of-Publication"] > date_now.year]
future_books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
37487,0671746103,MY TEACHER FRIED MY BRAINS (RACK SIZE) (MY TEA...,Coville,2030,Aladdin,http://images.amazon.com/images/P/0671746103.0...,http://images.amazon.com/images/P/0671746103.0...,http://images.amazon.com/images/P/0671746103.0...
55676,0671791990,MY TEACHER FLUNKED THE PLANET (RACK SIZE) (MY ...,Bruce Coville,2030,Aladdin,http://images.amazon.com/images/P/0671791990.0...,http://images.amazon.com/images/P/0671791990.0...,http://images.amazon.com/images/P/0671791990.0...
78168,0870449842,Crossing America,National Geographic Society,2030,National Geographic,http://images.amazon.com/images/P/0870449842.0...,http://images.amazon.com/images/P/0870449842.0...,http://images.amazon.com/images/P/0870449842.0...
80264,0140301690,Alice's Adventures in Wonderland and Through t...,Lewis Carroll,2050,Puffin Books,http://images.amazon.com/images/P/0140301690.0...,http://images.amazon.com/images/P/0140301690.0...,http://images.amazon.com/images/P/0140301690.0...
97826,0140201092,Outline of European Architecture (Pelican S.),Nikolaus Pevsner,2050,Penguin USA,http://images.amazon.com/images/P/0140201092.0...,http://images.amazon.com/images/P/0140201092.0...,http://images.amazon.com/images/P/0140201092.0...

In [456]:
mask_for_years = (books_df["Year-Of-Publication"] == 0) | (books_df["Year-Of-Publication"] > date_now.year) | \
    (books_df["Year-Of-Publication"] == 1376) | (books_df["Year-Of-Publication"] == 1378) 
books_df.loc[mask_for_years, "Year-Of-Publication"] = np.nan

In [457]:
future_books = books_df[books_df["Year-Of-Publication"] > date_now.year]
future_books.head()

Empty DataFrame
Columns: [ISBN, Book-Title, Book-Author, Year-Of-Publication, Publisher, Image-URL-S, Image-URL-M, Image-URL-L]
Index: []

In [458]:
df = books_df[books_df["ISBN"].isin(["0870449842", "0140301690", "964442011X", "9643112136"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
78168,0870449842,Crossing America,National Geographic Society,NaN,National Geographic,http://images.amazon.com/images/P/0870449842.0...,http://images.amazon.com/images/P/0870449842.0...,http://images.amazon.com/images/P/0870449842.0...
80264,0140301690,Alice's Adventures in Wonderland and Through t...,Lewis Carroll,NaN,Puffin Books,http://images.amazon.com/images/P/0140301690.0...,http://images.amazon.com/images/P/0140301690.0...,http://images.amazon.com/images/P/0140301690.0...
227531,9643112136,Dalan-i bihisht (Dastan-i Irani),Nazi Safavi,NaN,Intisharat-i Quqnus,http://images.amazon.com/images/P/9643112136.0...,http://images.amazon.com/images/P/9643112136.0...,http://images.amazon.com/images/P/9643112136.0...
253750,964442011X,Tasht-i khun,IsmaÂ°il Fasih,NaN,Nashr-i Alburz,http://images.amazon.com/images/P/964442011X.0...,http://images.amazon.com/images/P/964442011X.0...,http://images.amazon.com/images/P/964442011X.0...

In [459]:
books_df["Year-Of-Publication"] = books_df["Year-Of-Publication"].astype("Int64")

In [460]:
df = books_df[books_df["ISBN"].isin(["2264034602"])]
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
167446,2264034602,La Terre sous ses pieds,Salman Rushdie,2002,Éditions 10/18,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...,http://images.amazon.com/images/P/2264034602.0...

In [461]:
books_df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [462]:
books_df.to_csv("books_remaster.csv", sep=",", encoding='utf-8',  index=False, header=True, mode="w")

In [536]:
users_df.head()

   User-ID         City             State          Country   Age
0        1          nyc          new york              usa   NaN
1        2     stockton        california              usa  18.0
2        3       moscow   yukon territory           russia   NaN
3        4        porto          v.n.gaia         portugal  17.0
4        5  farnborough             hants   united kingdom   NaN

In [537]:
users_df.describe

<bound method NDFrame.describe of         User-ID         City             State          Country   Age
0             1          nyc          new york              usa   NaN
1             2     stockton        california              usa  18.0
2             3       moscow   yukon territory           russia   NaN
3             4        porto          v.n.gaia         portugal  17.0
4             5  farnborough             hants   united kingdom   NaN
...         ...          ...               ...              ...   ...
278853   278854     portland            oregon              usa   NaN
278854   278855       tacoma        washington   united kingdom  50.0
278855   278856     brampton           ontario           canada   NaN
278856   278857    knoxville         tennessee              usa   NaN
278857   278858       dublin               n/a          ireland   NaN

[278858 rows x 5 columns]>

In [538]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   User-ID  278858 non-null  int64
 1   City     278858 non-null  object
 2   State    278857 non-null  object
 3   Country  278856 non-null  object
 4   Age      168096 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 10.6+ MB

In [558]:
ratings_df.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [540]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [559]:
ratings_df["Ratings-ID"] = ratings_df.index
ratings_df = ratings_df.iloc[:,[3, 0, 1, 2]]

In [560]:
ratings_df.head()

   Ratings-ID  User-ID        ISBN  Book-Rating
0           0   276725  034545104X            0
1           1   276726  0155061224            5
2           2   276727  0446520802            0
3           3   276729  052165615X            3
4           4   276729  0521795028            6

In [566]:
location_df = users_df["Location"].str.split(",", expand=True, n=2)
location_df.head()

             0                 1                2
0          nyc          new york              usa
1     stockton        california              usa
2       moscow   yukon territory           russia
3        porto          v.n.gaia         portugal
4  farnborough             hants   united kingdom

In [567]:
location_df.rename(columns={0: "City", 1: "State", 2: "Country"},  inplace=True)
location_df.head()

          City             State          Country
0          nyc          new york              usa
1     stockton        california              usa
2       moscow   yukon territory           russia
3        porto          v.n.gaia         portugal
4  farnborough             hants   united kingdom

In [568]:
users_df = pd.concat([users_df,location_df], axis=1)
users_df = users_df.drop(columns="Location")

In [569]:
users_df.head()

   User-ID   Age         City             State          Country
0        1   NaN          nyc          new york              usa
1        2  18.0     stockton        california              usa
2        3   NaN       moscow   yukon territory           russia
3        4  17.0        porto          v.n.gaia         portugal
4        5   NaN  farnborough             hants   united kingdom

In [570]:
users_df = users_df.iloc[:,[0, 2, 3, 4, 1]]
users_df.head()

   User-ID         City             State          Country   Age
0        1          nyc          new york              usa   NaN
1        2     stockton        california              usa  18.0
2        3       moscow   yukon territory           russia   NaN
3        4        porto          v.n.gaia         portugal  17.0
4        5  farnborough             hants   united kingdom   NaN

In [ ]:
from sqlalchemy import create_engine
from sqlalchemy.exc import OperationalError

def connect_to_db():
    db_url = "postgresql://admin:root@localhost:5432/database"
    try:
        engine = create_engine(db_url)
        conn = engine.connect()
    except OperationalError as error:
        print(f"Chyba připojení k databázi: {error}")
        raise error
    print("Connection successful!")
    return conn

conn = connect_to_db()

Connection successful!

In [572]:
ratings_df = ratings_df.rename(columns={"Ratings_id": "Ratings-ID"})
ratings_df.head()

   Ratings-ID  User-ID        ISBN  Book-Rating
0           0   276725  034545104X            0
1           1   276726  0155061224            5
2           2   276727  0446520802            0
3           3   276729  052165615X            3
4           4   276729  0521795028            6

In [579]:
users_df.to_sql("users", con=conn, schema=None, if_exists="append", index=False)

858

In [581]:
books_df.to_sql("books", con=conn, schema=None, if_exists="append", index=False)

360

In [ ]:
if "ISBN" in ratings_df.columns and "ISBN" in books_df.columns:
        valid_isbn = set(books_df["ISBN"].dropna())
        mask_invalid_ratings_isbn = ratings_df["ISBN"].apply(lambda x: x not in valid_isbn if pd.notna(x) else False)
        
        # Nastavíme tato ISBN na NaN
        ratings_df.loc[mask_invalid_ratings_isbn, "ISBN"] = np.nan

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [597]:
ratings_df.to_sql("ratings", con=conn, schema=None, if_exists="append", index=False)

IntegrityError: (psycopg2.errors.NotNullViolation) null value in column "ISBN" of relation "ratings" violates not-null constraint
DETAIL:  Failing row contains (6, 276736, null, 8).

[SQL: INSERT INTO ratings ("Ratings-ID", "User-ID", "ISBN", "Book-Rating") VALUES (%(Ratings-ID__0)s, %(User-ID__0)s, %(ISBN__0)s, %(Book-Rating__0)s), (%(Ratings-ID__1)s, %(User-ID__1)s, %(ISBN__1)s, %(Book-Rating__1)s), (%(Ratings-ID__2)s, %(User-ID__2)s ... 77284 characters truncated ...  %(Book-Rating__998)s), (%(Ratings-ID__999)s, %(User-ID__999)s, %(ISBN__999)s, %(Book-Rating__999)s)]
[parameters: {'User-ID__0': 276725, 'Ratings-ID__0': 0, 'ISBN__0': '034545104X', 'Book-Rating__0': 0, 'User-ID__1': 276726, 'Ratings-ID__1': 1, 'ISBN__1': '0155061224', 'Book-Rating__1': 5, 'User-ID__2': 276727, 'Ratings-ID__2': 2, 'ISBN__2': '0446520802', 'Book-Rating__2': 0, 'User-ID__3': 276729, 'Ratings-ID__3': 3, 'ISBN__3': '052165615X', 'Book-Rating__3': 3, 'User-ID__4': 276729, 'Ratings-ID__4': 4, 'ISBN__4': '0521795028', 'Book-Rating__4': 6, 'User-ID__5': 276733, 'Ratings-ID__5': 5, 'ISBN__5': '2080674722', 'Book-Rating__5': 0, 'User-ID__6': 276736, 'Ratings-ID__6': 6, 'ISBN__6': None, 'Book-Rating__6': 8, 'User-ID__7': 276737, 'Ratings-ID__7': 7, 'ISBN__7': None, 'Book-Rating__7': 6, 'User-ID__8': 276744, 'Ratings-ID__8': 8, 'ISBN__8': '038550120X', 'Book-Rating__8': 7, 'User-ID__9': 276745, 'Ratings-ID__9': 9, 'ISBN__9': None, 'Book-Rating__9': 10, 'User-ID__10': 276746, 'Ratings-ID__10': 10, 'ISBN__10': '0425115801', 'Book-Rating__10': 0, 'User-ID__11': 276746, 'Ratings-ID__11': 11, 'ISBN__11': '0449006522', 'Book-Rating__11': 0, 'User-ID__12': 276746, 'Ratings-ID__12': 12 ... 3900 parameters truncated ... 'ISBN__987': '0812500067', 'Book-Rating__987': 0, 'User-ID__988': 277168, 'Ratings-ID__988': 988, 'ISBN__988': '0812516001', 'Book-Rating__988': 0, 'User-ID__989': 277168, 'Ratings-ID__989': 989, 'ISBN__989': '0812568710', 'Book-Rating__989': 5, 'User-ID__990': 277168, 'Ratings-ID__990': 990, 'ISBN__990': '0843921609', 'Book-Rating__990': 6, 'User-ID__991': 277168, 'Ratings-ID__991': 991, 'ISBN__991': '0890875588', 'Book-Rating__991': 0, 'User-ID__992': 277168, 'Ratings-ID__992': 992, 'ISBN__992': '1557730091', 'Book-Rating__992': 0, 'User-ID__993': 277168, 'Ratings-ID__993': 993, 'ISBN__993': '1558172882', 'Book-Rating__993': 0, 'User-ID__994': 277170, 'Ratings-ID__994': 994, 'ISBN__994': '0425178102', 'Book-Rating__994': 0, 'User-ID__995': 277170, 'Ratings-ID__995': 995, 'ISBN__995': '0446609404', 'Book-Rating__995': 0, 'User-ID__996': 277170, 'Ratings-ID__996': 996, 'ISBN__996': '0446610038', 'Book-Rating__996': 0, 'User-ID__997': 277170, 'Ratings-ID__997': 997, 'ISBN__997': '0451178017', 'Book-Rating__997': 0, 'User-ID__998': 277170, 'Ratings-ID__998': 998, 'ISBN__998': '0553211056', 'Book-Rating__998': 9, 'User-ID__999': 277170, 'Ratings-ID__999': 999, 'ISBN__999': '0553285920', 'Book-Rating__999': 9}]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
import psycopg2

#Connection to DBS through psycog2
def connect_to_db(db="database"):
    try:
        conn = psycopg2.connect(database=db,
                                host="localhost",
                                user="user",
                                password="database",
                                port="5432")
    except Exception as error:
        print("There has been an error: " + error)
    print("Connection successful!")
    return conn

In [549]:
books_df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [552]:
pd.io.sql.get_schema(books_df.reset_index(), 'books')

'CREATE TABLE "books" (\n"index" INTEGER,\n  "ISBN" TEXT,\n  "Book-Title" TEXT,\n  "Book-Author" TEXT,\n  "Year-Of-Publication" INTEGER,\n  "Publisher" TEXT,\n  "Image-URL-S" TEXT,\n  "Image-URL-M" TEXT,\n  "Image-URL-L" TEXT\n)'

In [553]:
pd.io.sql.get_schema(ratings_df.reset_index(), 'ratings')

'CREATE TABLE "ratings" (\n"index" INTEGER,\n  "ratings_id" INTEGER,\n  "User-ID" INTEGER,\n  "ISBN" TEXT,\n  "Book-Rating" INTEGER\n)'

In [554]:
pd.io.sql.get_schema(users_df.reset_index(), 'users')

'CREATE TABLE "users" (\n"index" INTEGER,\n  "User-ID" INTEGER,\n  "City" TEXT,\n  "State" TEXT,\n  "Country" TEXT,\n  "Age" REAL\n)'

In [601]:
if os.path.exists("db_init/data/"):
    # Smaže všechny soubory v adresáři
    for filename in os.listdir("db_init/data/"):
        file_path = os.path.join("db_init/data/", filename)
        if os.path.isfile(file_path):
            os.remove(file_path)  # Smaže soubor

In [602]:
users_df.head()

   User-ID         City             State          Country   Age
0        1          nyc          new york              usa   NaN
1        2     stockton        california              usa  18.0
2        3       moscow   yukon territory           russia   NaN
3        4        porto          v.n.gaia         portugal  17.0
4        5  farnborough             hants   united kingdom   NaN